app/controllers/v1/search_monitors_controller.rb

  def index_buyer
    @buyers_and_tenders = []
    @search_monitors = current_user.search_monitors
    @search_monitors.each do |data|
      search_monitors = { id: "", buyer: "", tenders_count: "" }
      search_monitors[:id] = data.id
      search_monitors[:buyer] = data.buyer
      search_monitors[:tenders_count] = data.tenders_count
      @buyers_and_tenders.push search_monitors
---
SELECT  "search_monitors".* FROM "search_monitors" WHERE "search_monitors"."user_id" = $1 ORDER BY "search_monitors"."id" DESC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
UPDATE "search_monitors" SET "updated_at" = $1, "monitor_type" = $2 WHERE "search_monitors"."id" = $3  [["updated_at", "2019-01-10 12:50:02.799645"], ["monitor_type", 0], ["id", 1]]